In [1]:
# Import pandas and numpy libraries.
import pandas as pd
import numpy as np

In [3]:
sales1 = pd.Series([200, 300, 400, 800], index=['Microsoft', 'Uber', 'Google', 'Make-In-India'])
sales1

Microsoft        200
Uber             300
Google           400
Make-In-India    800
dtype: int64

In [7]:
sales2 = pd.Series([250, 340, 500, 1000], index=['Uber', 'Microsoft', 'Google', 'Make-In-India'])
sales2

Uber              250
Microsoft         340
Google            500
Make-In-India    1000
dtype: int64

In [8]:
sales3 = pd.Series([450, 640, 800, 1400], index=['Uber', 'Google', 'Microsoft', 'Make-In-India'])
sales3

Uber              450
Google            640
Microsoft         800
Make-In-India    1400
dtype: int64

In [9]:
dataframe1 = pd.DataFrame({ 2017: sales1, 2018:sales2, 2019:sales3})
dataframe1

               2017  2018  2019
Google          400   500   640
Make-In-India   800  1000  1400
Microsoft       200   340   800
Uber            300   250   450

In [13]:
# slicing using [ operator]
dataframe1[0:2:1] # Same as dataframe1[0:2]

               2017  2018  2019
Google          400   500   640
Make-In-India   800  1000  1400

In [24]:
dataframe1.iloc[[0, 3]] # gives google and uber result basis of index

        2017  2018  2019
Google   400   500   640
Uber     300   250   450

In [25]:
dataframe1.loc[['Make-In-India', 'Uber']]

               2017  2018  2019
Make-In-India   800  1000  1400
Uber            300   250   450

In [33]:
dataframe1 = pd.DataFrame({ 'A2017': sales1, 'B2018':sales2, 'C2019':sales3})
dataframe1

               A2017  B2018  C2019
Google           400    500    640
Make-In-India    800   1000   1400
Microsoft        200    340    800
Uber             300    250    450

In [38]:
# show which companies has more than 350 sales in 2017 year.
dataframe1.A2017 > 350 # key should be string for using this.

Google            True
Make-In-India     True
Microsoft        False
Uber             False
Name: A2017, dtype: bool

In [40]:
# showing result in standar manner.
dataframe1[dataframe1.A2017 > 350]

               A2017  B2018  C2019
Google           400    500    640
Make-In-India    800   1000   1400

In [42]:
# using labels and columns
dataframe1.at['Make-In-India', 'C2019'] # column can be int

1400

In [43]:
dataframe1

               A2017  B2018  C2019
Google           400    500    640
Make-In-India    800   1000   1400
Microsoft        200    340    800
Uber             300    250    450

In [44]:
# using label and column index(iat() method)
dataframe1.iat[3,1] # Uber at B2018

250